yekong6663/STM32_Learning/Standard_Lib/10.2硬件I2C/Hardware/MPU650.c
#include "stm32f10x.h"                  // Device header
#include "MPU650_String.h"
//MPU思路：先是读写寄存器，再是初始化、获取ID、读取角速度和加速度
//等待函数
void MPU650_WaitForTask(I2C_TypeDef* I2Cx, uint32_t I2C_EVENT)
{
	uint32_t Timeout  = 10000;
	while( !I2C_CheckEvent(I2Cx,I2C_EVENT) )
	{	
		Timeout--;
		if(!Timeout)
			break;
	}	
}
//读取思路：开始、发送MPU地址+接收应答、发送寄存器地址（参数）+接收应答、发送数据+接收应答、结束	
void MPU650_WriteReg(uint8_t RegAddress,uint8_t Data)
{
	I2C_GenerateSTART(I2C2,ENABLE);//MyI2C_Start();
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_MODE_SELECT);//等待EV5
	
	I2C_Send7bitAddress(I2C2,MPU6050_ADDRESS,I2C_Direction_Transmitter);//MyI2C_SendByte(MPU6050_ADDRESS)+MyI2C_ReceiveACK();
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED);//等待EV6
	
	I2C_SendData(I2C2,RegAddress);								//MyI2C_SendByte(RegAddress);+MyI2C_ReceiveACK；
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_BYTE_TRANSMITTING);//等待EV8

	I2C_SendData(I2C2,Data);									//MyI2C_SendByte(Data)+MyI2C_ReceiveACK;
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_BYTE_TRANSMITTED);//等待EV8_2

	I2C_GenerateSTOP(I2C2,ENABLE);//MyI2C_Stop();	                                                             
}

//接收思路：开始、发送MPU地址+接收应答、发送寄存器地址（参数）+接收应答
//接着：再次开始、发送变化的MPU地址+接收应答、接收数据+发送应答、结束
uint8_t MPU650_ReadReg(uint8_t RegAddress)
{
	uint8_t Data;
	I2C_GenerateSTART(I2C2,ENABLE);//MyI2C_Start();
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_MODE_SELECT);//等待EV5
	
	I2C_Send7bitAddress(I2C2,MPU6050_ADDRESS,I2C_Direction_Transmitter);//MyI2C_SendByte(MPU6050_ADDRESS)+MyI2C_ReceiveACK();
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED);//等待EV6
	
	I2C_SendData(I2C2,RegAddress);								//MyI2C_SendByte(RegAddress);+MyI2C_ReceiveACK；
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_BYTE_TRANSMITTED);//等待EV8_2
	
	I2C_GenerateSTART(I2C2,ENABLE);//MyI2C_Start();
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_MODE_SELECT);//等待EV5
	
	//MyI2C_SendByte(MPU6050_ADDRESS| 0x01)+MyI2C_ReceiveACK();通过修改第三个参数来反应是否| 0x01
	I2C_Send7bitAddress(I2C2,MPU6050_ADDRESS,I2C_Direction_Receiver);
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED);//等待EV6（注意与发送的EV6不同）
	
	//接收、接收倒二个数据、配置应答为否、结束、等待EV7、接收最后一个数据、配置应答为是、返回
	I2C_AcknowledgeConfig(I2C2,DISABLE);
	I2C_GenerateSTOP(I2C2,ENABLE);
	MPU650_WaitForTask(I2C2,I2C_EVENT_MASTER_BYTE_RECEIVED);//等待EV7
	Data = I2C_ReceiveData(I2C2);
	I2C_AcknowledgeConfig(I2C2,ENABLE);
	return Data;
}
void MPU650_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2,ENABLE);
	
	GPIO_InitTypeDef GPIOStruct;
	GPIOStruct.GPIO_Mode = GPIO_Mode_AF_OD;//配置复用开漏输出
	GPIOStruct.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIOStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIOStruct);
	
	GPIO_SetBits(GPIOB, GPIO_Pin_10 | GPIO_Pin_11);
	
	I2C_InitTypeDef I2CStruct;
	I2CStruct.I2C_Ack = I2C_Ack_Enable;
	I2CStruct.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2CStruct.I2C_ClockSpeed = 50000;
	I2CStruct.I2C_DutyCycle = I2C_DutyCycle_2;
	I2CStruct.I2C_Mode = I2C_Mode_I2C;
	I2CStruct.I2C_OwnAddress1 = 0x00;
	I2C_Init(I2C2,&I2CStruct);
	
	I2C_Cmd(I2C2,ENABLE);
	
	MPU650_WriteReg(MPU6050_PWR_MGMT_1, 0x01);
	MPU650_WriteReg(MPU6050_PWR_MGMT_2, 0x00);
	MPU650_WriteReg(MPU6050_SMPLRT_DIV, 0x09);
	MPU650_WriteReg(MPU6050_CONFIG, 0x06);
	MPU650_WriteReg(MPU6050_GYRO_CONFIG, 0x18);
	MPU650_WriteReg(MPU6050_ACCEL_CONFIG, 0x18);
}


uint8_t MPU650_GetID(void)
{
	return MPU650_ReadReg(MPU6050_WHO_AM_I);
}

void MPU6050_GetData(int16_t *AccX, int16_t *AccY, int16_t *AccZ, 
					int16_t *GyroX, int16_t *GyroY, int16_t *GyroZ)
{
	uint8_t DataH, DataL;//组合数据
	
	DataH = MPU650_ReadReg(MPU6050_ACCEL_XOUT_H);
	DataL = MPU650_ReadReg(MPU6050_ACCEL_XOUT_L);
	*AccX = (DataH << 8) | DataL;//高位数据向左移8位与低位数据组合
	
	DataH = MPU650_ReadReg(MPU6050_ACCEL_YOUT_H);
	DataL = MPU650_ReadReg(MPU6050_ACCEL_YOUT_L);
	*AccY = (DataH << 8) | DataL;
	
	DataH = MPU650_ReadReg(MPU6050_ACCEL_ZOUT_H);
	DataL = MPU650_ReadReg(MPU6050_ACCEL_ZOUT_L);
	*AccZ = (DataH << 8) | DataL;
	
	DataH = MPU650_ReadReg(MPU6050_GYRO_XOUT_H);
	DataL = MPU650_ReadReg(MPU6050_GYRO_XOUT_L);
	*GyroX = (DataH << 8) | DataL;
	
	DataH = MPU650_ReadReg(MPU6050_GYRO_YOUT_H);
	DataL = MPU650_ReadReg(MPU6050_GYRO_YOUT_L);
	*GyroY = (DataH << 8) | DataL;
	
	DataH = MPU650_ReadReg(MPU6050_GYRO_ZOUT_H);
	DataL = MPU650_ReadReg(MPU6050_GYRO_ZOUT_L);
	*GyroZ = (DataH << 8) | DataL;
}
